#include <string.h>
#include "queue.h"
//------------------------------------------------------------

//-----------------------自定义变量区-------------------------

//
//------------------------------------------------------------


//-----------------------函数实现区---------------------------

/*------------------------------------------------------------
@名    称: QueueInitial
@功    能: 队列初始化
@入口参数:  
    q: 队列
@出口参数: 无
@返 回 值: 无
------------------------------------------------------------*/
void QueueInitial(S_Queue_t *q)
{
    q->head = 0;
	q->tail = 0;
}

/*队列长度*/
/*------------------------------------------------------------
@名    称: QueueSize
@功    能: 队列长度
@入口参数:  
    q: 队列
@出口参数: 无
@返 回 值: 队列长度
------------------------------------------------------------*/
int QueueSize(S_Queue_t *q)
{
    return ((q->head+QUEUE_MAX_SIZE - q->tail)%QUEUE_MAX_SIZE);
}


/*------------------------------------------------------------
@名    称: IsQueueEmpty
@功    能: 队列判空
@入口参数:  
    q: 队列
@出口参数: 无
@返 回 值: 
    1=空，0=不空
------------------------------------------------------------*/
int IsQueueEmpty(S_Queue_t *q)
{
    if(q->tail == q->head)
    {
        return 1;
    }
    else
        return 0;
}


/*------------------------------------------------------------
@名    称: IsQueueFull
@功    能: 队列判满
@入口参数:  
    q: 队列
@出口参数: 无
@返 回 值: 
    1=满，0=不满
------------------------------------------------------------*/
int IsQueueFull(S_Queue_t *q)
{
	Qsize_t pos;
	pos = (q->head + 1)	% QUEUE_MAX_SIZE;
	if(pos == q->tail)
		return 1;
	else
		return 0;
}


/*------------------------------------------------------------
@名    称: PopQueue
@功    能: 出队
@入口参数:  
        q: 队列
    pData: 出队数据存储地址
@出口参数: 出队数据
@返 回 值: 
    0=成功, -1=失败
------------------------------------------------------------*/
Qdata_t PopQueue(S_Queue_t *q)
{
    Qdata_t data=0;
 //    if(IsQueueEmpty(q) != 1)
    if(q->tail != q->head)	/*非空*/
    {
        data = q->data[q->tail];
        q->tail = (q->tail+1) % QUEUE_MAX_SIZE;
        return data;
    }
    return 0; 
}


/*------------------------------------------------------------
@名    称: PushQueue
@功    能: 入队
@入口参数:  
        q: 队列
    pData: 入队数据
@出口参数: 无
@返 回 值: 
    0=成功, -1=失败
------------------------------------------------------------*/
int	PushQueue(S_Queue_t *q, Qdata_t data)
{
    Qsize_t pos;
	
    pos = (q->head + 1)	% QUEUE_MAX_SIZE;
//    if(IsQueueFull(q) != 1)
    if(pos != q->tail)	  /*非满*/
    {
        q->data[q->head] = data;
        q->head = pos;
        return 0;
    }
    return -1;
}

/*---------------------------------------------------------------------*/
//end file
